In [20]:
import pandas as pd

In [21]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19]}

df = pd.DataFrame(data1)
df

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [22]:
df["Name"] ##列(縦)の取得

0       Tom
1    Joseph
2       Bob
Name: Name, dtype: object

In [23]:
df[["Name","Age"]] ##複数列の取得
# データ型はDataFrameになる

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [24]:
df.loc[0] ##行(横)の取得

Name    Tom
Age      20
Name: 0, dtype: object

In [25]:
df.loc[1:2,"Name":"Age"] ##複数行の取得
# df.loc[縦の範囲(スライス),"横の範囲(スライス)"]
## 片方がスライスでも大丈夫
# データ型はDataFrameになる

     Name  Age
1  Joseph   21
2     Bob   19

In [26]:
df.iloc[0:2,0:2] ##行と列の取得
# ilocは縦の範囲を番号で指定する
# 0から始まるので注意

     Name  Age
0     Tom   20
1  Joseph   21

In [27]:
df.at[0,"Name"] ##特定の要素の取得

'Tom'

In [28]:
df.iat[0,0] ##特定の要素の取得
# iatは縦の範囲を番号で指定する

'Tom'

In [29]:
df.info() ##データフレームの情報を取得

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [30]:
df_age = df[df["Age"] > 20] ##条件に合致するデータを取得
display(df_age.head())  ## 条件はいろいろある(CS3-4-5)
## andやorを使う場合は&や|を使う

     Name  Age
1  Joseph   21

In [31]:
df_new_age = df_age.reset_index()
display(df_new_age.head()) ## indexの番号を振り直す

   index    Name  Age
0      1  Joseph   21

In [32]:
df["Age_in_days"] = df["Age"] * 365 ##新しい列を追加
df

     Name  Age  Age_in_days
0     Tom   20         7300
1  Joseph   21         7665
2     Bob   19         6935

In [33]:
df.at[0,"Age"] = 99 ##特定の要素を変更
df

     Name  Age  Age_in_days
0     Tom   99         7300
1  Joseph   21         7665
2     Bob   19         6935

In [34]:
df.iat[1,1] = 88 ##特定の要素を変更
# iatは縦の範囲を番号で指定する
df

     Name  Age  Age_in_days
0     Tom   99         7300
1  Joseph   88         7665
2     Bob   19         6935

In [35]:
df.drop(columns="Age_in_days",inplace=True) ##列(縦)を削除
# inplace=Trueで元のデータフレームを変更(変数=dfに代入しなくて良い)
df

     Name  Age
0     Tom   99
1  Joseph   88
2     Bob   19

In [36]:
df.drop(index=1, inplace=True) ##行(横)を削除
df

  Name  Age
0  Tom   99
2  Bob   19

In [37]:
df1 = pd.DataFrame([[0,1,2],[3,4,5]],columns = ['A','B','C'],index = ['a','b'])
df1  ##column = 横の名前を指定, index = 縦の名前を指定

   A  B  C
a  0  1  2
b  3  4  5

In [38]:
df1.columns = ["D","E","F"] 
df1.index = ["c","d"] 
df1  ##columns, indexは後から変更できる

   D  E  F
c  0  1  2
d  3  4  5

In [39]:
data2 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19],'Category': ['A', 'B', 'A']}
df2 = pd.DataFrame(data2)
df2["Sales"] = [200,300,400]
df2["Gender"] = ["M","F","M"]
df2

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [40]:
df2.sort_values(by="Sales") ##Salesを基準に昇順でソート

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [41]:
df2.sort_values(by="Sales",ascending=False) ##Salesを基準に降順でソート

     Name  Age Category  Sales Gender
2     Bob   19        A    400      M
1  Joseph   21        B    300      F
0     Tom   20        A    200      M

In [ ]:
max = df2["Sales"].idxmax() ##最大値のインデックスを取得
print(max)

2

In [43]:
min = df2["Sales"].idxmin() ##最小値のインデックスを取得
print(min)

0